## Plan Result (demo-apim)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain will be created
  + resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      + api_management_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-demo"
      + id                = (known after apply)

      + gateway {
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt.demo.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappsdemo.vault.azure.net/secrets/wildcard-demo-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "cft-api-mgmt-appgw.demo.platform.hmcts.net"
          + key_vault_id                 = "https://acmedcdcftappsdemo.vault.azure.net/secrets/wildcard-demo-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1353,"Program":"tfcmt","SHA1":"","Target":"demo-apim","Vars":{}} -->